tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1618_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1618_H_
#define _PIC16LF1618_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define SSP1IF                        60
#define TXIF                          61
#define RCIF                          62
#define ADIF                          63
#define TMR1GIF                       64
#define PIR2                          65
#define CCP2IF                        66
#define TMR4IF                        67
#define TMR6IF                        68
#define BCL1IF                        69
#define C1IF                          70
#define C2IF                          71
#define PIR3                          72
#define CLC1IF                        73
#define CLC2IF                        74
#define ZCDIF                         75
#define CWGIF                         76
#define PIR4                          77
#define SMT1IF                        78
#define SMT1PRAIF                     79
#define SMT1PWAIF                     80
#define SMT2IF                        81
#define SMT2PRAIF                     82
#define SMT2PWAIF                     83
#define CRCIF                         84
#define SCANIF                        85
#define PIR5                          86
#define PID1DIF                       87
#define PID1EIF                       88
#define AT1IF                         89
#define TMR5IF                        90
#define TMR5GIF                       91
#define TMR3IF                        92
#define TMR3GIF                       93
#define TMR0                          94
#define TMR1L                         95
#define TMR1H                         96
#define T1CON                         97
#define TMR1ON                        98
#define nT1SYNC                       99
#define T1CKPS0                       100
#define T1CKPS                        101
#define T1CKPS1                       102
#define TMR1CS0                       103
#define TMR1CS                        104
#define TMR1CS1                       105
#define T1GCON                        106
#define T1GSS0                        107
#define T1GSS                         108
#define T1GSS1                        109
#define T1GVAL                        110
#define T1GGO_nDONE                   111
#define T1GSPM                        112
#define T1GTM                         113
#define T1GPOL                        114
#define TMR1GE                        115
#define T2TMR                         116
#define TMR2                          117
#define T2TMR_TMR                     118
#define T2PR                          119
#define T2PR_PR                       120
#define T2CON                         121
#define T2OUTPS0                      122
#define T2CON_OUTPS0                  123
#define T2OUTPS                       124
#define T2CON_OUTPS                   125
#define T2OUTPS1                      126
#define T2CON_OUTPS1                  127
#define T2OUTPS2                      128
#define T2CON_OUTPS2                  129
#define T2OUTPS3                      130
#define T2CON_OUTPS3                  131
#define T2CKPS0                       132
#define T2CON_CKPS                    133
#define T2CKPS                        134
#define T2CON_CKPS0                   135
#define T2CKPS1                       136
#define T2CON_CKPS1                   137
#define T2CKPS2                       138
#define T2CON_CKPS2                   139
#define T2CON_ON                      140
#define TMR2ON                        141
#define T2ON                          142
#define T2HLT                         143
#define T2HLT_MODE                    144
#define T2MODE                        145
#define T2MODE0                       146
#define T2HLT_MODE0                   147
#define T2MODE1                       148
#define T2HLT_MODE1                   149
#define T2MODE2                       150
#define T2HLT_MODE2                   151
#define T2MODE3                       152
#define T2HLT_MODE3                   153
#define T2MODE4                       154
#define T2HLT_MODE4                   155
#define T2HLT_CKSYNC                  156
#define T2CKSYNC                      157
#define T2HLT_CKPOL                   158
#define T2CKPOL                       159
#define T2PSYNC                       160
#define T2HLT_PSYNC                   161
#define T2CLKCON                      162
#define T2CS                          163
#define T2CS0                         164
#define T2CLKCON_CS                   165
#define T2CLKCON_CS0                  166
#define T2CS1                         167
#define T2CLKCON_CS1                  168
#define T2CS2                         169
#define T2CLKCON_CS2                  170
#define T2CS3                         171
#define T2CLKCON_CS3                  172
#define T2RST                         173
#define T2RSEL0                       174
#define T2RST_RSEL                    175
#define T2RSEL                        176
#define T2RST_RSEL0                   177
#define T2RSEL1                       178
#define T2RST_RSEL1                   179
#define T2RST_RSEL2                   180
#define T2RSEL2                       181
#define T2RSEL3                       182
#define T2RST_RSEL3                   183
#define TRISA                         184
#define TRISA0                        185
#define TRISA1                        186
#define TRISA2                        187
#define TRISA3                        188
#define TRISA4                        189
#define TRISA5                        190
#define TRISB                         191
#define TRISB4                        192
#define TRISB5                        193
#define TRISB6                        194
#define TRISB7                        195
#define TRISC                         196
#define TRISC0                        197
#define TRISC1                        198
#define TRISC2                        199
#define TRISC3                        200
#define TRISC4                        201
#define TRISC5                        202
#define TRISC6                        203
#define TRISC7                        204
#define PIE1                          205
#define TMR1IE                        206
#define TMR2IE                        207
#define CCP1IE                        208
#define SSP1IE                        209
#define TXIE                          210
#define RCIE                          211
#define ADIE                          212
#define TMR1GIE                       213
#define PIE2                          214
#define CCP2IE                        215
#define TMR4IE                        216
#define TMR6IE                        217
#define BCL1IE                        218
#define C1IE                          219
#define C2IE                          220
#define PIE3                          221
#define CLC1IE                        222
#define CLC2IE                        223
#define ZCDIE                         224
#define CWGIE                         225
#define PIE4                          226
#define SMT1IE                        227
#define SMT1PRAIE                     228
#define SMT1PWAIE                     229
#define SMT2IE                        230
#define SMT2PRAIE                     231
#define SMT2PWAIE                     232
#define CRCIE                         233
#define SCANIE                        234
#define PIE5                          235
#define PID1DIE                       236
#define PID1EIE                       237
#define AT1IE                         238
#define TMR5IE                        239
#define TMR5GIE                       240
#define TMR3IE                        241
#define TMR3GIE                       242
#define OPTION_REG                    243
#define OPTION_REG_PS                 244
#define OPTION_REG_PS0                245
#define OPTION_REG_PS1                246
#define PS2                           247
#define PSA                           248
#define T0SE                          249
#define TMR0SE                        250
#define T0CS                          251
#define TMR0CS                        252
#define INTEDG                        253
#define nWPUEN                        254
#define PCON                          255
#define nBOR                          256
#define nPOR                          257
#define nRI                           258
#define nRMCLR                        259
#define nRWDT                         260
#define nWDTWV                        261
#define STKUNF                        262
#define STKOVF                        263
#define OSCTUNE                       264
#define TUN0                          265
#define TUN                           266
#define TUN1                          267
#define TUN2                          268
#define TUN3                          269
#define TUN4                          270
#define TUN5                          271
#define OSCCON                        272
#define SCS0                          273
#define SCS                           274
#define SCS1                          275
#define IRCF                          276
#define IRCF0                         277
#define IRCF1                         278
#define IRCF2                         279
#define IRCF3                         280
#define SPLLEN                        281
#define OSCSTAT                       282
#define HFIOFS                        283
#define LFIOFR                        284
#define MFIOFR                        285
#define HFIOFL                        286
#define HFIOFR                        287
#define PLLR                          288
#define ADRESL                        289
#define ADRESH                        290
#define ADCON0                        291
#define ADON                          292
#define GO_nDONE                      293
#define GO                            294
#define ADGO                          295
#define CHS0                          296
#define CHS                           297
#define CHS1                          298
#define CHS2                          299
#define CHS3                          300
#define CHS4                          301
#define ADCON1                        302
#define ADPREF0                       303
#define ADPREF                        304
#define ADPREF1                       305
#define ADCS0                         306
#define ADCS                          307
#define ADCS1                         308
#define ADCS2                         309
#define ADFM                          310
#define ADCON2                        311
#define TRIGSEL                       312
#define TRIGSEL0                      313
#define TRIGSEL1                      314
#define TRIGSEL2                      315
#define TRIGSEL3                      316
#define LATA                          317
#define LATA0                         318
#define LATA1                         319
#define LATA2                         320
#define LATA3                         321
#define LATA4                         322
#define LATA5                         323
#define LATB                          324
#define LATB4                         325
#define LATB5                         326
#define LATB6                         327
#define LATB7                         328
#define LATC                          329
#define LATC0                         330
#define LATC1                         331
#define LATC2                         332
#define LATC3                         333
#define LATC4                         334
#define LATC5                         335
#define LATC6                         336
#define LATC7                         337
#define CM1CON0                       338
#define C1SYNC                        339
#define C1HYS                         340
#define C1SP                          341
#define C1POL                         342
#define C1OUT                         343
#define C1ON                          344
#define CM1CON1                       345
#define C1NCH0                        346
#define C1NCH                         347
#define C1NCH1                        348
#define C1NCH2                        349
#define C1PCH                         350
#define C1PCH0                        351
#define C1PCH1                        352
#define C1INTN                        353
#define C1INTP                        354
#define CM2CON0                       355
#define C2SYNC                        356
#define C2HYS                         357
#define C2SP                          358
#define C2POL                         359
#define C2OUT                         360
#define C2ON                          361
#define CM2CON1                       362
#define C2NCH0                        363
#define C2NCH                         364
#define C2NCH1                        365
#define C2NCH2                        366
#define C2PCH                         367
#define C2PCH0                        368
#define C2PCH1                        369
#define C2INTN                        370
#define C2INTP                        371
#define CMOUT                         372
#define MC1OUT                        373
#define MC2OUT                        374
#define BORCON                        375
#define BORRDY                        376
#define BORFS                         377
#define SBOREN                        378
#define FVRCON                        379
#define ADFVR0                        380
#define ADFVR                         381
#define ADFVR1                        382
#define CDAFVR                        383
#define CDAFVR0                       384
#define CDAFVR1                       385
#define TSRNG                         386
#define TSEN                          387
#define FVRRDY                        388
#define FVREN                         389
#define DAC1CON0                      390
#define DAC1PSS                       391
#define D1PSS0                        392
#define D1PSS1                        393
#define DAC1OE                        394
#define DAC1EN                        395
#define DAC1CON1                      396
#define DAC1R                         397
#define DAC1R0                        398
#define DAC1R1                        399
#define DAC1R2                        400
#define DAC1R3                        401
#define DAC1R4                        402
#define DAC1R5                        403
#define DAC1R6                        404
#define DAC1R7                        405
#define ZCD1CON                       406
#define ZCD1INTN                      407
#define ZCD1INTP                      408
#define ZCD1POL                       409
#define ZCD1OUT                       410
#define ZCD1EN                        411
#define ANSA0                         412
#define ANSELA                        413
#define ANSA1                         414
#define ANSA2                         415
#define ANSA4                         416
#define ANSELB                        417
#define ANSB4                         418
#define ANSB5                         419
#define ANSB6                         420
#define ANSB7                         421
#define ANSC0                         422
#define ANSELC                        423
#define ANSC1                         424
#define ANSC2                         425
#define ANSC3                         426
#define ANSC6                         427
#define ANSC7                         428
#define PMADRL                        429
#define PMADRH                        430
#define PMDATL                        431
#define PMDATH                        432
#define PMCON1                        433
#define RD                            434
#define WR                            435
#define WREN                          436
#define WRERR                         437
#define FREE                          438
#define LWLO                          439
#define CFGS                          440
#define PMCON2                        441
#define RC1REG                        442
#define TX1REG                        443
#define SP1BRGL                       444
#define SP1BRGH                       445
#define RC1STA                        446
#define RX9D                          447
#define OERR                          448
#define FERR                          449
#define ADDEN                         450
#define CREN                          451
#define SREN                          452
#define RX9                           453
#define SPEN                          454
#define TX1STA                        455
#define TX9D                          456
#define TRMT                          457
#define BRGH                          458
#define SENDB                         459
#define SYNC                          460
#define TXEN                          461
#define TX9                           462
#define CSRC                          463
#define BAUD1CON                      464
#define ABDEN                         465
#define WUE                           466
#define BRG16                         467
#define SCKP                          468
#define RCIDL                         469
#define ABDOVF                        470
#define WPUA                          471
#define WPUA0                         472
#define WPUA_WPUA                     473
#define WPUA1                         474
#define WPUA2                         475
#define WPUA3                         476
#define WPUA4                         477
#define WPUA5                         478
#define WPUB                          479
#define WPUB4                         480
#define WPUB5                         481
#define WPUB6                         482
#define WPUB7                         483
#define WPUC                          484
#define WPUC0                         485
#define WPUC_WPUA                     486
#define WPUC1                         487
#define WPUC2                         488
#define WPUC3                         489
#define WPUC4                         490
#define WPUC5                         491
#define WPUC6                         492
#define WPUC7                         493
#define SSP1BUF                       494
#define BUF                           495
#define BUF0                          496
#define SSP1BUF0                      497
#define BUF1                          498
#define SSP1BUF1                      499
#define BUF2                          500
#define SSP1BUF2                      501
#define BUF3                          502
#define SSP1BUF3                      503
#define BUF4                          504
#define SSP1BUF4                      505
#define BUF5                          506
#define SSP1BUF5                      507
#define BUF6                          508
#define SSP1BUF6                      509
#define BUF7                          510
#define SSP1BUF7                      511
#define ADD0                          512
#define ADD                           513
#define SSP1ADD0                      514
#define SSP1ADD                       515
#define ADD1                          516
#define SSP1ADD1                      517
#define ADD2                          518
#define SSP1ADD2                      519
#define ADD3                          520
#define SSP1ADD3                      521
