tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1618_tdd.h
#define ADD4                          522
#define SSP1ADD4                      523
#define ADD5                          524
#define SSP1ADD5                      525
#define ADD6                          526
#define SSP1ADD6                      527
#define ADD7                          528
#define SSP1ADD7                      529
#define SSP1MSK0                      530
#define SSP1MSK                       531
#define MSK0                          532
#define MSK                           533
#define SSP1MSK1                      534
#define MSK1                          535
#define SSP1MSK2                      536
#define MSK2                          537
#define SSP1MSK3                      538
#define MSK3                          539
#define SSP1MSK4                      540
#define MSK4                          541
#define SSP1MSK5                      542
#define MSK5                          543
#define SSP1MSK6                      544
#define MSK6                          545
#define SSP1MSK7                      546
#define MSK7                          547
#define SSP1STAT                      548
#define BF                            549
#define UA                            550
#define R_nW                          551
#define S                             552
#define P                             553
#define D_nA                          554
#define CKE                           555
#define SMP                           556
#define SSP1CON1                      557
#define SSPM0                         558
#define SSPM                          559
#define SSPM1                         560
#define SSPM2                         561
#define SSPM3                         562
#define CKP                           563
#define SSPEN                         564
#define SSPOV                         565
#define WCOL                          566
#define SSP1CON2                      567
#define SSP1CON2_SEN                  568
#define RSEN                          569
#define PEN                           570
#define RCEN                          571
#define ACKEN                         572
#define ACKDT                         573
#define ACKSTAT                       574
#define GCEN                          575
#define SSP1CON3                      576
#define DHEN                          577
#define AHEN                          578
#define SBCDE                         579
#define SDAHT                         580
#define BOEN                          581
#define SCIE                          582
#define PCIE                          583
#define ACKTIM                        584
#define ODCONA                        585
#define ODA0                          586
#define ODA1                          587
#define ODA2                          588
#define ODA4                          589
#define ODA5                          590
#define ODCONB                        591
#define ODB4                          592
#define ODB5                          593
#define ODB6                          594
#define ODB7                          595
#define ODCONC                        596
#define ODC0                          597
#define ODC1                          598
#define ODC2                          599
#define ODC3                          600
#define ODC4                          601
#define ODC5                          602
#define ODC6                          603
#define ODC7                          604
#define CCPR1L                        605
#define CCPR1L_RL                     606
#define CCPR1H                        607
#define CCPR1H_RH                     608
#define CCP1CON                       609
#define CCP1MODE0                     610
#define CCP1CON_MODE0                 611
#define CCP1CON_MODE                  612
#define CCP1MODE                      613
#define CCP1MODE1                     614
#define CCP1CON_MODE1                 615
#define CCP1MODE2                     616
#define CCP1CON_MODE2                 617
#define CCP1MODE3                     618
#define CCP1CON_MODE3                 619
#define CCP1CON_FMT                   620
#define CCP1FMT                       621
#define CCP1CON_OUT                   622
#define CCP1OUT                       623
#define CCP1EN                        624
#define CCP1CON_EN                    625
#define CCP1CAP                       626
#define CCP1CTS0                      627
#define CCP1CAP_CTS                   628
#define CCP1CAP_CTS0                  629
#define CCP1CTS                       630
#define CCP1CTS1                      631
#define CCP1CAP_CTS1                  632
#define CCP1CTS2                      633
#define CCP1CAP_CTS2                  634
#define CCPR2L                        635
#define CCPR2L_RL                     636
#define CCPR2H                        637
#define CCPR2H_RH                     638
#define CCP2CON                       639
#define CCP2MODE                      640
#define CCP2MODE0                     641
#define CCP2CON_MODE0                 642
#define CCP2CON_MODE                  643
#define CCP2MODE1                     644
#define CCP2CON_MODE1                 645
#define CCP2MODE2                     646
#define CCP2CON_MODE2                 647
#define CCP2MODE3                     648
#define CCP2CON_MODE3                 649
#define CCP2FMT                       650
#define CCP2CON_FMT                   651
#define CCP2OUT                       652
#define CCP2CON_OUT                   653
#define CCP2EN                        654
#define CCP2CON_EN                    655
#define CCP2CAP                       656
#define CCP2CAP_CTS                   657
#define CCP2CAP_CTS0                  658
#define CCP2CTS                       659
#define CCP2CTS0                      660
#define CCP2CAP_CTS1                  661
#define CCP2CTS1                      662
#define CCP2CAP_CTS2                  663
#define CCP2CTS2                      664
#define CCPTMRS                       665
#define CCP1TSEL0                     666
#define CCP1TSEL                      667
#define CCP1TSEL1                     668
#define CCP2TSEL0                     669
#define CCP2TSEL                      670
#define CCP2TSEL1                     671
#define P3TSEL                        672
#define P3TSEL0                       673
#define P3TSEL1                       674
#define P4TSEL0                       675
#define P4TSEL                        676
#define P4TSEL1                       677
#define SLRCONA                       678
#define SLRA0                         679
#define SLRA1                         680
#define SLRA2                         681
#define SLRA4                         682
#define SLRA5                         683
#define SLRCONB                       684
#define SLRB4                         685
#define SLRB5                         686
#define SLRB6                         687
#define SLRB7                         688
#define SLRCONC                       689
#define SLRC0                         690
#define SLRC1                         691
#define SLRC2                         692
#define SLRC3                         693
#define SLRC4                         694
#define SLRC5                         695
#define SLRC6                         696
#define SLRC7                         697
#define INLVLA                        698
#define INLVLA0                       699
#define INLVLA1                       700
#define INLVLA2                       701
#define INLVLA3                       702
#define INLVLA4                       703
#define INLVLA5                       704
#define INLVLB                        705
#define INLVLB4                       706
#define INLVLB5                       707
#define INLVLB6                       708
#define INLVLB7                       709
#define INLVLC                        710
#define INLVLC0                       711
#define INLVLC1                       712
#define INLVLC2                       713
#define INLVLC3                       714
#define INLVLC4                       715
#define INLVLC5                       716
#define INLVLC6                       717
#define INLVLC7                       718
#define IOCAP                         719
#define IOCAP0                        720
#define IOCAP1                        721
#define IOCAP2                        722
#define IOCAP3                        723
#define IOCAP4                        724
#define IOCAP5                        725
#define IOCAN0                        726
#define IOCAN                         727
#define IOCAN1                        728
#define IOCAN2                        729
#define IOCAN3                        730
#define IOCAN4                        731
#define IOCAN5                        732
#define IOCAF0                        733
#define IOCAF                         734
#define IOCAF1                        735
#define IOCAF2                        736
#define IOCAF3                        737
#define IOCAF4                        738
#define IOCAF5                        739
#define IOCBP                         740
#define IOCBP4                        741
#define IOCBP5                        742
#define IOCBP6                        743
#define IOCBP7                        744
#define IOCBN                         745
#define IOCBN4                        746
#define IOCBN5                        747
#define IOCBN6                        748
#define IOCBN7                        749
#define IOCBF                         750
#define IOCBF4                        751
#define IOCBF5                        752
#define IOCBF6                        753
#define IOCBF7                        754
#define IOCCP                         755
#define IOCCP0                        756
#define IOCCP1                        757
#define IOCCP2                        758
#define IOCCP3                        759
#define IOCCP4                        760
#define IOCCP5                        761
#define IOCCP6                        762
#define IOCCP7                        763
#define IOCCN                         764
#define IOCCN0                        765
#define IOCCN1                        766
#define IOCCN2                        767
#define IOCCN3                        768
#define IOCCN4                        769
#define IOCCN5                        770
#define IOCCN6                        771
#define IOCCN7                        772
#define IOCCF                         773
#define IOCCF0                        774
#define IOCCF1                        775
#define IOCCF2                        776
#define IOCCF3                        777
#define IOCCF4                        778
#define IOCCF5                        779
#define IOCCF6                        780
#define IOCCF7                        781
#define HDRVC                         782
#define HIDC4                         783
#define HIDC5                         784
#define T4TMR                         785
#define TMR4                          786
#define T4TMR_TMR                     787
#define T4PR_PR                       788
#define T4PR                          789
#define T4CON                         790
#define T4OUTPS0                      791
#define T4CON_OUTPS                   792
#define T4OUTPS                       793
#define T4CON_OUTPS0                  794
#define T4OUTPS1                      795
#define T4CON_OUTPS1                  796
#define T4CON_OUTPS2                  797
#define T4OUTPS2                      798
#define T4OUTPS3                      799
#define T4CON_OUTPS3                  800
#define T4CON_CKPS0                   801
#define T4CKPS0                       802
#define T4CON_CKPS                    803
#define T4CKPS                        804
#define T4CKPS1                       805
#define T4CON_CKPS1                   806
#define T4CKPS2                       807
#define T4CON_CKPS2                   808
#define T4ON                          809
#define T4CON_ON                      810
#define TMR4ON                        811
#define T4HLT                         812
#define T4MODE                        813
#define T4HLT_MODE                    814
#define T4HLT_MODE0                   815
#define T4MODE0                       816
#define T4HLT_MODE1                   817
#define T4MODE1                       818
#define T4HLT_MODE2                   819
#define T4MODE2                       820
#define T4HLT_MODE3                   821
#define T4MODE3                       822
#define T4HLT_MODE4                   823
#define T4MODE4                       824
#define T4CKSYNC                      825
#define T4HLT_CKSYNC                  826
#define T4HLT_CKPOL                   827
#define T4CKPOL                       828
#define T4PSYNC                       829
#define T4HLT_PSYNC                   830
#define T4CLKCON                      831
#define T4CS                          832
#define T4CLKCON_CS                   833
#define T4CS0                         834
#define T4CLKCON_CS0                  835
#define T4CS1                         836
#define T4CLKCON_CS1                  837
#define T4CS2                         838
#define T4CLKCON_CS2                  839
#define T4CS3                         840
#define T4CLKCON_CS3                  841
#define T4RST                         842
#define T4RSEL0                       843
#define T4RSEL                        844
#define T4RST_RSEL                    845
#define T4RST_RSEL0                   846
#define T4RSEL1                       847
#define T4RST_RSEL1                   848
#define T4RSEL2                       849
#define T4RST_RSEL2                   850
#define T4RSEL3                       851
#define T4RST_RSEL3                   852
#define T6TMR                         853
#define TMR6                          854
#define T6TMR_TMR                     855
#define T6PR_PR                       856
#define T6PR                          857
#define T6CON                         858
#define T6CON_OUTPS0                  859
#define T6OUTPS                       860
#define T6CON_OUTPS                   861
#define T6OUTPS0                      862
#define T6CON_OUTPS1                  863
#define T6OUTPS1                      864
#define T6CON_OUTPS2                  865
#define T6OUTPS2                      866
#define T6CON_OUTPS3                  867
#define T6OUTPS3                      868
#define T6CON_CKPS0                   869
#define T6CKPS                        870
#define T6CKPS0                       871
#define T6CON_CKPS                    872
#define T6CON_CKPS1                   873
#define T6CKPS1                       874
#define T6CON_CKPS2                   875
#define T6CKPS2                       876
#define TMR6ON                        877
#define T6ON                          878
#define T6CON_ON                      879
#define T6HLT                         880
#define T6MODE0                       881
#define T6HLT_MODE0                   882
#define T6HLT_MODE                    883
#define T6MODE                        884
#define T6HLT_MODE1                   885
#define T6MODE1                       886
#define T6HLT_MODE2                   887
#define T6MODE2                       888
#define T6HLT_MODE3                   889
#define T6MODE3                       890
#define T6MODE4                       891
#define T6HLT_MODE4                   892
#define T6CKSYNC                      893
#define T6HLT_CKSYNC                  894
#define T6CKPOL                       895
#define T6HLT_CKPOL                   896
#define T6PSYNC                       897
#define T6HLT_PSYNC                   898
#define T6CLKCON                      899
#define T6CS                          900
#define T6CLKCON_CS                   901
#define T6CLKCON_CS0                  902
#define T6CS0                         903
#define T6CLKCON_CS1                  904
#define T6CS1                         905
#define T6CLKCON_CS2                  906
#define T6CS2                         907
#define T6CLKCON_CS3                  908
#define T6CS3                         909
#define T6RST                         910
#define T6RST_RSEL                    911
#define T6RST_RSEL0                   912
#define T6RSEL                        913
#define T6RSEL0                       914
#define T6RST_RSEL1                   915
#define T6RSEL1                       916
#define T6RSEL2                       917
#define T6RST_RSEL2                   918
#define T6RST_RSEL3                   919
#define T6RSEL3                       920
#define TMR3L                         921
#define TMR3H                         922
#define T3CON                         923
#define TMR3ON                        924
#define T3SYNC                        925
#define T3CKPS                        926
#define T3CKPS0                       927
#define T3CKPS1                       928
#define TMR3CS0                       929
#define TMR3CS                        930
#define TMR3CS1                       931
#define T3GCON                        932
#define T3GSS0                        933
#define T3GSS                         934
#define T3GSS1                        935
#define T3GVAL                        936
#define T3GGO_nDONE                   937
#define T3GSPM                        938
#define T3GTM                         939
#define T3GPOL                        940
#define TMR3GE                        941
#define TMR5L                         942
#define TMR5H                         943
#define T5CON                         944
#define TMR5ON                        945
#define T5SYNC                        946
#define T5CKPS                        947
#define T5CKPS0                       948
#define T5CKPS1                       949
#define TMR5CS0                       950
#define TMR5CS                        951
#define TMR5CS1                       952
#define T5GCON                        953
#define T5GSS                         954
#define T5GSS0                        955
#define T5GSS1                        956
#define T5GVAL                        957
#define T5GGO_nDONE                   958
#define T5GSPM                        959
#define T5GTM                         960
#define T5GPOL                        961
#define TMR5GE                        962
#define PID1SETL                      963
#define PID1SET0                      964
#define SET0                          965
#define PID1SET1                      966
#define SET1                          967
#define SET2                          968
#define PID1SET2                      969
#define SET3                          970
#define PID1SET3                      971
#define SET4                          972
#define PID1SET4                      973
#define SET5                          974
#define PID1SET5                      975
#define SET6                          976
#define PID1SET6                      977
#define SET7                          978
#define PID1SET7                      979
#define PID1SETH                      980
#define SET8                          981
#define PID1SET8                      982
#define SET9                          983
#define PID1SET9                      984
#define SET10                         985
#define PID1SET10                     986
#define SET11                         987
#define PID1SET11                     988
#define SET12                         989
#define PID1SET12                     990
#define SET13                         991
#define PID1SET13                     992
#define SET14                         993
#define PID1SET14                     994
#define SET15                         995
#define PID1SET15                     996
#define PID1INL                       997
#define IN0                           998
#define PID1IN0                       999
#define IN1                           1000
#define PID1IN1                       1001
#define IN2                           1002
#define PID1IN2                       1003
#define IN3                           1004
#define PID1IN3                       1005
#define IN4                           1006
#define PID1IN4                       1007
#define IN5                           1008
#define PID1IN5                       1009
#define IN6                           1010
#define PID1IN6                       1011
#define IN7                           1012
#define PID1IN7                       1013
#define PID1INH                       1014
#define IN8                           1015
#define PID1IN8                       1016
#define IN9                           1017
#define PID1IN9                       1018
#define PID1IN10                      1019
#define IN10                          1020
#define PID1IN11                      1021
#define IN11                          1022
#define PID1IN12                      1023
#define IN12                          1024
#define PID1IN13                      1025
#define IN13                          1026
#define PID1IN14                      1027
#define IN14                          1028
#define IN15                          1029
#define PID1IN15                      1030
#define PID1K1L                       1031
#define K10                           1032
#define PID1K10                       1033
#define K11                           1034
#define PID1K11                       1035
#define K12                           1036
#define PID1K12                       1037
#define K13                           1038
#define PID1K13                       1039
#define K14                           1040
#define PID1K14                       1041
#define K15                           1042
#define PID1K15                       1043
#define K16                           1044
#define PID1K16                       1045
#define K17                           1046
#define PID1K17                       1047
#define PID1K1H                       1048
#define K18                           1049
#define PID1K18                       1050
#define K19                           1051
#define PID1K19                       1052
#define PID1K110                      1053
#define K110                          1054
#define PID1K111                      1055
#define K111                          1056
#define PID1K112                      1057
#define K112                          1058
#define PID1K113                      1059
#define K113                          1060
#define PID1K114                      1061
#define K114                          1062
#define PID1K115                      1063
#define K115                          1064
#define PID1K2L                       1065
#define K20                           1066
#define PID1K20                       1067
#define K21                           1068
#define PID1K21                       1069
#define K22                           1070
#define PID1K22                       1071
#define K23                           1072
#define PID1K23                       1073
#define K24                           1074
#define PID1K24                       1075
#define K25                           1076
#define PID1K25                       1077
#define K26                           1078
#define PID1K26                       1079
#define K27                           1080
#define PID1K27                       1081
#define PID1K2H                       1082
#define K28                           1083
#define PID1K28                       1084
#define K29                           1085
#define PID1K29                       1086
#define PID1K210                      1087
#define K210                          1088
#define PID1K211                      1089
#define K211                          1090
