tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1618_tdd.h
#define PID1K212                      1091
#define K212                          1092
#define PID1K213                      1093
#define K213                          1094
#define PID1K214                      1095
#define K214                          1096
#define PID1K215                      1097
#define K215                          1098
#define PID1K3L                       1099
#define K30                           1100
#define PID1K30                       1101
#define K31                           1102
#define PID1K31                       1103
#define K32                           1104
#define PID1K32                       1105
#define K33                           1106
#define PID1K33                       1107
#define K34                           1108
#define PID1K34                       1109
#define K35                           1110
#define PID1K35                       1111
#define K36                           1112
#define PID1K36                       1113
#define K37                           1114
#define PID1K37                       1115
#define PID1K3H                       1116
#define K38                           1117
#define PID1K38                       1118
#define PID1K39                       1119
#define K39                           1120
#define K310                          1121
#define PID1K310                      1122
#define K311                          1123
#define PID1K311                      1124
#define K312                          1125
#define PID1K312                      1126
#define K313                          1127
#define PID1K313                      1128
#define K314                          1129
#define PID1K314                      1130
#define K315                          1131
#define PID1K315                      1132
#define PID1OUTLL                     1133
#define OUT0                          1134
#define PID1OUT0                      1135
#define OUT1                          1136
#define PID1OUT1                      1137
#define OUT2                          1138
#define PID1OUT2                      1139
#define OUT3                          1140
#define PID1OUT3                      1141
#define OUT4                          1142
#define PID1OUT4                      1143
#define OUT5                          1144
#define PID1OUT5                      1145
#define OUT6                          1146
#define PID1OUT6                      1147
#define OUT7                          1148
#define PID1OUT7                      1149
#define PID1OUTLH                     1150
#define OUT8                          1151
#define PID1OUT8                      1152
#define OUT9                          1153
#define PID1OUT9                      1154
#define PID1OUT10                     1155
#define OUT10                         1156
#define PID1OUT11                     1157
#define OUT11                         1158
#define OUT12                         1159
#define PID1OUT12                     1160
#define OUT13                         1161
#define PID1OUT13                     1162
#define PID1OUT14                     1163
#define OUT14                         1164
#define PID1OUT15                     1165
#define OUT15                         1166
#define PID1OUTHL                     1167
#define PID1OUT16                     1168
#define OUT16                         1169
#define PID1OUT17                     1170
#define OUT17                         1171
#define OUT18                         1172
#define PID1OUT18                     1173
#define OUT19                         1174
#define PID1OUT19                     1175
#define OUT20                         1176
#define PID1OUT20                     1177
#define OUT21                         1178
#define PID1OUT21                     1179
#define OUT22                         1180
#define PID1OUT22                     1181
#define OUT23                         1182
#define PID1OUT23                     1183
#define PID1OUTHH                     1184
#define OUT24                         1185
#define PID1OUT24                     1186
#define OUT25                         1187
#define PID1OUT25                     1188
#define OUT26                         1189
#define PID1OUT26                     1190
#define OUT27                         1191
#define PID1OUT27                     1192
#define OUT28                         1193
#define PID1OUT28                     1194
#define OUT29                         1195
#define PID1OUT29                     1196
#define PID1OUT30                     1197
#define OUT30                         1198
#define OUT31                         1199
#define PID1OUT31                     1200
#define PID1OUTU                      1201
#define OUT32                         1202
#define PID1OUT32                     1203
#define OUT33                         1204
#define PID1OUT33                     1205
#define OUT34                         1206
#define PID1OUT34                     1207
#define OUT35                         1208
#define PID1OUT35                     1209
#define PID1Z1L                       1210
#define PID1Z10                       1211
#define Z10                           1212
#define PID1Z11                       1213
#define Z11                           1214
#define PID1Z12                       1215
#define Z12                           1216
#define PID1Z13                       1217
#define Z13                           1218
#define PID1Z14                       1219
#define Z14                           1220
#define PID1Z15                       1221
#define Z15                           1222
#define PID1Z16                       1223
#define Z16                           1224
#define PID1Z17                       1225
#define Z17                           1226
#define PID1Z1H                       1227
#define Z18                           1228
#define PID1Z18                       1229
#define Z19                           1230
#define PID1Z19                       1231
#define Z110                          1232
#define PID1Z110                      1233
#define Z111                          1234
#define PID1Z111                      1235
#define Z112                          1236
#define PID1Z112                      1237
#define Z113                          1238
#define PID1Z113                      1239
#define Z114                          1240
#define PID1Z114                      1241
#define Z115                          1242
#define PID1Z115                      1243
#define PID1Z1U                       1244
#define Z116                          1245
#define PID1Z116                      1246
#define PID1Z2L                       1247
#define Z20                           1248
#define PID1Z20                       1249
#define Z21                           1250
#define PID1Z21                       1251
#define Z22                           1252
#define PID1Z22                       1253
#define Z23                           1254
#define PID1Z23                       1255
#define Z24                           1256
#define PID1Z24                       1257
#define Z25                           1258
#define PID1Z25                       1259
#define Z26                           1260
#define PID1Z26                       1261
#define Z27                           1262
#define PID1Z27                       1263
#define PID1Z2H                       1264
#define Z28                           1265
#define PID1Z28                       1266
#define Z29                           1267
#define PID1Z29                       1268
#define PID1Z210                      1269
#define Z210                          1270
#define PID1Z211                      1271
#define Z211                          1272
#define PID1Z212                      1273
#define Z212                          1274
#define PID1Z213                      1275
#define Z213                          1276
#define PID1Z214                      1277
#define Z214                          1278
#define PID1Z215                      1279
#define Z215                          1280
#define PID1Z2U                       1281
#define PID1Z216                      1282
#define Z216                          1283
#define PID1ACCLL                     1284
#define PID1ACCLL_ACC0                1285
#define PID1ACC0                      1286
#define PID1ACCLL_ACC1                1287
#define PID1ACC1                      1288
#define PID1ACCLL_ACC2                1289
#define PID1ACC2                      1290
#define PID1ACCLL_ACC3                1291
#define PID1ACC3                      1292
#define PID1ACCLL_ACC4                1293
#define PID1ACC4                      1294
#define PID1ACCLL_ACC5                1295
#define PID1ACC5                      1296
#define PID1ACCLL_ACC6                1297
#define PID1ACC6                      1298
#define PID1ACCLL_ACC7                1299
#define PID1ACC7                      1300
#define PID1ACCLH                     1301
#define PID1ACCLH_ACC8                1302
#define PID1ACC8                      1303
#define PID1ACCLH_ACC9                1304
#define PID1ACC9                      1305
#define PID1ACC10                     1306
#define PID1ACCLH_ACC10               1307
#define PID1ACC11                     1308
#define PID1ACCLH_ACC11               1309
#define PID1ACC12                     1310
#define PID1ACCLH_ACC12               1311
#define PID1ACC13                     1312
#define PID1ACCLH_ACC13               1313
#define PID1ACC14                     1314
#define PID1ACCLH_ACC14               1315
#define PID1ACC15                     1316
#define PID1ACCLH_ACC15               1317
#define PID1ACCHL                     1318
#define PID1ACC16                     1319
#define ACC16                         1320
#define PID1ACC17                     1321
#define ACC17                         1322
#define PID1ACC18                     1323
#define ACC18                         1324
#define PID1ACC19                     1325
#define ACC19                         1326
#define ACC20                         1327
#define PID1ACC20                     1328
#define ACC21                         1329
#define PID1ACC21                     1330
#define ACC22                         1331
#define PID1ACC22                     1332
#define ACC23                         1333
#define PID1ACC23                     1334
#define PID1ACCHH                     1335
#define ACC24                         1336
#define PID1ACC24                     1337
#define ACC25                         1338
#define PID1ACC25                     1339
#define ACC26                         1340
#define PID1ACC26                     1341
#define ACC27                         1342
#define PID1ACC27                     1343
#define ACC28                         1344
#define PID1ACC28                     1345
#define ACC29                         1346
#define PID1ACC29                     1347
#define PID1ACC30                     1348
#define ACC30                         1349
#define ACC31                         1350
#define PID1ACC31                     1351
#define PID1ACCU                      1352
#define ACC32                         1353
#define PID1ACC32                     1354
#define ACC33                         1355
#define PID1ACC33                     1356
#define PID1ACC34                     1357
#define ACC34                         1358
#define PID1CON                       1359
#define PID1CON_MODE0                 1360
#define PID1MODE0                     1361
#define PID1CON_MODE                  1362
#define PID1MODE                      1363
#define PID1CON_MODE1                 1364
#define PID1MODE1                     1365
#define PID1CON_MODE2                 1366
#define PID1MODE2                     1367
#define PID1CON_BUSY                  1368
#define PID1BUSY                      1369
#define PID1EN                        1370
#define PID1CON_EN                    1371
#define PWM3DCL                       1372
#define PWM3DC0                       1373
#define PWM3DCL_PWMPW0                1374
#define PWM3DCL_DC0                   1375
#define PWM3DCL_DC                    1376
#define PWM3DC1                       1377
#define PWM3DCL_PWMPW1                1378
#define PWM3DCL_DC1                   1379
#define PWM3DCH                       1380
#define PWM3DC2                       1381
#define PWM3DCH_DC2                   1382
#define PWM3DCH_DC                    1383
#define PWM3DCH_PWMPW2                1384
#define PWM3DC3                       1385
#define PWM3DCH_DC3                   1386
#define PWM3DCH_PWMPW3                1387
#define PWM3DC4                       1388
#define PWM3DCH_DC4                   1389
#define PWM3DCH_PWMPW4                1390
#define PWM3DC5                       1391
#define PWM3DCH_DC5                   1392
#define PWM3DCH_PWMPW5                1393
#define PWM3DC6                       1394
#define PWM3DCH_DC6                   1395
#define PWM3DCH_PWMPW6                1396
#define PWM3DC7                       1397
#define PWM3DCH_DC7                   1398
#define PWM3DCH_PWMPW7                1399
#define PWM3DC8                       1400
#define PWM3DCH_DC8                   1401
#define PWM3DCH_PWMPW8                1402
#define PWM3DC9                       1403
#define PWM3DCH_DC9                   1404
#define PWM3DCH_PWMPW9                1405
#define PWM3CON                       1406
#define PWM3CON_POL                   1407
#define PWM3POL                       1408
#define PWM3CON_OUT                   1409
#define PWM3OUT                       1410
#define PWM3EN                        1411
#define PWM3CON_EN                    1412
#define PWM4DCL                       1413
#define PWM4DCL_PWMPW0                1414
#define PWM4DCL_DC                    1415
#define PWM4DC0                       1416
#define PWM4DCL_DC0                   1417
#define PWM4DCL_PWMPW1                1418
#define PWM4DC1                       1419
#define PWM4DCL_DC1                   1420
#define PWM4DCH                       1421
#define PWM4DCH_PWMPW2                1422
#define PWM4DCH_DC                    1423
#define PWM4DC2                       1424
#define PWM4DCH_DC2                   1425
#define PWM4DCH_PWMPW3                1426
#define PWM4DC3                       1427
#define PWM4DCH_DC3                   1428
#define PWM4DCH_PWMPW4                1429
#define PWM4DC4                       1430
#define PWM4DCH_DC4                   1431
#define PWM4DCH_PWMPW5                1432
#define PWM4DC5                       1433
#define PWM4DCH_DC5                   1434
#define PWM4DCH_PWMPW6                1435
#define PWM4DC6                       1436
#define PWM4DCH_DC6                   1437
#define PWM4DCH_PWMPW7                1438
#define PWM4DC7                       1439
#define PWM4DCH_DC7                   1440
#define PWM4DCH_PWMPW8                1441
#define PWM4DC8                       1442
#define PWM4DCH_DC8                   1443
#define PWM4DCH_PWMPW9                1444
#define PWM4DC9                       1445
#define PWM4DCH_DC9                   1446
#define PWM4CON                       1447
#define PWM4POL                       1448
#define PWM4CON_POL                   1449
#define PWM4CON_OUT                   1450
#define PWM4OUT                       1451
#define PWM4EN                        1452
#define PWM4CON_EN                    1453
#define CWG1DBR0                      1454
#define CWG1DBR                       1455
#define DBR                           1456
#define DBR0                          1457
#define CWG1DBR1                      1458
#define DBR1                          1459
#define CWG1DBR2                      1460
#define DBR2                          1461
#define CWG1DBR3                      1462
#define DBR3                          1463
#define CWG1DBR4                      1464
#define DBR4                          1465
#define CWG1DBR5                      1466
#define DBR5                          1467
#define CWG1DBF                       1468
#define CWG1DBF0                      1469
#define DBF                           1470
#define DBF0                          1471
#define CWG1DBF1                      1472
#define DBF1                          1473
#define CWG1DBF2                      1474
#define DBF2                          1475
#define CWG1DBF3                      1476
#define DBF3                          1477
#define CWG1DBF4                      1478
#define DBF4                          1479
#define DBF5                          1480
#define CWG1DBF5                      1481
#define CWG1AS0                       1482
#define CWG1LSAC                      1483
#define LSAC                          1484
#define LSAC0                         1485
#define CWG1LSAC0                     1486
#define LSAC1                         1487
#define CWG1LSAC1                     1488
#define LSBD0                         1489
#define CWG1LSBD0                     1490
#define LSBD                          1491
#define CWG1LSBD                      1492
#define LSBD1                         1493
#define CWG1LSBD1                     1494
#define CWG1REN                       1495
#define REN                           1496
#define CWG1SHUTDOWN                  1497
#define SHUTDOWN                      1498
#define CWG1AS1                       1499
#define INAS                          1500
#define CWG1INAS                      1501
#define C1AS                          1502
#define CWG1C1AS                      1503
#define C2AS                          1504
#define CWG1C2AS                      1505
#define TMR2AS                        1506
#define CWG1TMR2AS                    1507
#define CWG1TMR4AS                    1508
#define TMR4AS                        1509
#define CWG1TMR6AS                    1510
#define TMR6AS                        1511
#define CWG1OCON0                     1512
#define CWG1STRA                      1513
#define STRA                          1514
#define STRB                          1515
#define CWG1STRB                      1516
#define CWG1STRC                      1517
#define STRC                          1518
#define CWG1STRD                      1519
#define STRD                          1520
#define OVRA                          1521
#define CWG1OVRA                      1522
#define CWG1OVRB                      1523
#define OVRB                          1524
#define OVRC                          1525
#define CWG1OVRC                      1526
#define OVRD                          1527
#define CWG1OVRD                      1528
#define CWG1CON0                      1529
#define CWG1MODE0                     1530
#define CWG1CON0_MODE0                1531
#define CWG1MODE                      1532
#define CWG1CON0_MODE                 1533
#define CWG1MODE1                     1534
#define CWG1CON0_MODE1                1535
#define CWG1MODE2                     1536
#define CWG1CON0_MODE2                1537
#define LD                            1538
#define CWG1LD                        1539
#define CWG1CON0_EN                   1540
#define CWG1EN                        1541
#define G1EN                          1542
#define CWG1CON1                      1543
#define CWG1POLA                      1544
#define POLA                          1545
#define CWG1POLB                      1546
#define POLB                          1547
#define CWG1POLC                      1548
#define POLC                          1549
#define CWG1POLD                      1550
#define POLD                          1551
#define IN                            1552
#define CWG1IN                        1553
#define CWG1CLKCON                    1554
#define CWG1CLKCON_CS                 1555
#define CWG1CS                        1556
#define CWG1ISM                       1557
#define CWG1IS                        1558
#define IS                            1559
#define IS0                           1560
#define CWG1IS0                       1561
#define CWG1IS1                       1562
#define IS1                           1563
#define IS2                           1564
#define CWG1IS2                       1565
#define IS3                           1566
#define CWG1IS3                       1567
#define WDTCON0                       1568
#define WDTCON0_SEN                   1569
#define SWDTEN                        1570
#define WDTSEN                        1571
#define WDTPS                         1572
#define WDTPS0                        1573
#define WDTPS1                        1574
#define WDTPS2                        1575
#define WDTPS3                        1576
#define WDTPS4                        1577
#define WDTCON1                       1578
#define WDTWINDOW0                    1579
#define WINDOW0                       1580
#define WINDOW                        1581
#define WDTWINDOW                     1582
#define WDTWINDOW1                    1583
#define WINDOW1                       1584
#define WDTWINDOW2                    1585
#define WINDOW2                       1586
#define WDTCS                         1587
#define WDTCS0                        1588
#define WDTCS1                        1589
#define WDTCS2                        1590
#define WDTPSL                        1591
#define WDTPSL_WDTPSCNT               1592
#define WDTPSL_PSCNT                  1593
#define WDTPSCNT0                     1594
#define PSCNT0                        1595
#define WDTPSCNT1                     1596
#define PSCNT1                        1597
#define WDTPSCNT2                     1598
#define PSCNT2                        1599
#define WDTPSCNT3                     1600
#define PSCNT3                        1601
#define WDTPSCNT4                     1602
#define PSCNT4                        1603
#define WDTPSCNT5                     1604
#define PSCNT5                        1605
#define WDTPSCNT6                     1606
#define PSCNT6                        1607
#define WDTPSCNT7                     1608
#define PSCNT7                        1609
#define WDTPSH                        1610
#define PSCNT8                        1611
#define WDTPSH_WDTPSCNT               1612
#define WDTPSH_PSCNT                  1613
#define WDTPSCNT8                     1614
#define PSCNT9                        1615
#define WDTPSCNT9                     1616
#define PSCNT10                       1617
#define WDTPSCNT10                    1618
#define PSCNT11                       1619
#define WDTPSCNT11                    1620
#define PSCNT12                       1621
#define WDTPSCNT12                    1622
#define PSCNT13                       1623
#define WDTPSCNT13                    1624
#define PSCNT14                       1625
#define WDTPSCNT14                    1626
#define PSCNT15                       1627
#define WDTPSCNT15                    1628
#define PSCNT16                       1629
#define WDTPSCNT16                    1630
#define WDTPSCNT17                    1631
#define PSCNT17                       1632
#define STATE                         1633
#define WDTSTATE                      1634
#define WDTTMR                        1635
#define WDTTMR0                       1636
#define WDTTMR1                       1637
#define WDTTMR2                       1638
#define WDTTMR3                       1639
#define WDTTMR4                       1640
#define SCANLADRL                     1641
#define SCANLADRL_LADR                1642
#define LDAR0                         1643
#define SCANLADRL_SCANLADR            1644
#define SCANLADR0                     1645
#define SCANLADR1                     1646
#define LDAR1                         1647
#define LADR2                         1648
