tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1618_tdd.h
#define SCANLADR2                     1649
#define LADR3                         1650
#define SCANLADR3                     1651
#define LADR4                         1652
#define SCANLADR4                     1653
#define LADR5                         1654
#define SCANLADR5                     1655
#define SCANLADR6                     1656
#define LADR6                         1657
#define LADR7                         1658
#define SCANLADR7                     1659
#define SCANLADRH                     1660
#define LADR8                         1661
#define SCANLADRH_SCANLADR            1662
#define SCANLADR8                     1663
#define SCANLADRH_LADR                1664
#define LADR9                         1665
#define SCANLADR9                     1666
#define LADR10                        1667
#define SCANLADR10                    1668
#define SCANLADR11                    1669
#define LADR11                        1670
#define LADR12                        1671
#define SCANLADR12                    1672
#define LADR13                        1673
#define SCANLADR13                    1674
#define LADR14                        1675
#define SCANLADR14                    1676
#define LADR15                        1677
#define SCANLADR15                    1678
#define SCANHADRL                     1679
#define SCANHADR0                     1680
#define HADR0                         1681
#define SCANHADRL_HADR                1682
#define SCANHADRL_SCANHADR            1683
#define SCANHADR1                     1684
#define HADR1                         1685
#define SCANHADR2                     1686
#define HARD2                         1687
#define SCANHADR3                     1688
#define HADR3                         1689
#define SCANHADR4                     1690
#define HADR4                         1691
#define SCANHADR5                     1692
#define HADR5                         1693
#define SCANHADR6                     1694
#define HADR6                         1695
#define SCANHADR7                     1696
#define HADR7                         1697
#define SCANHADRH                     1698
#define HADR8                         1699
#define SCANHADRH_SCANHADR            1700
#define SCANHADR8                     1701
#define SCANHADRH_HADR                1702
#define HADR9                         1703
#define SCANHADR9                     1704
#define HADR10                        1705
#define SCANHADR10                    1706
#define SCANHADR11                    1707
#define HADR11                        1708
#define HADR12                        1709
#define SCANHADR12                    1710
#define HADR13                        1711
#define SCANHADR13                    1712
#define HADR14                        1713
#define SCANHADR14                    1714
#define HADR15                        1715
#define SCANHADR15                    1716
#define SCANCON0                      1717
#define SCANMODE                      1718
#define SCANMODE0                     1719
#define SCANCON0_MODE0                1720
#define SCANCON0_MODE                 1721
#define SCANCON0_MODE1                1722
#define SCANMODE1                     1723
#define INTM                          1724
#define SCANINTM                      1725
#define INVALID                       1726
#define SCANINVALID                   1727
#define SCANCON0_BUSY                 1728
#define SCANBUSY                      1729
#define SCANGO                        1730
#define SCANEN                        1731
#define SCANCON0_EN                   1732
#define SCANTRIG                      1733
#define TSEL0                         1734
#define TSEL                          1735
#define SCANTSEL0                     1736
#define SCANTSEL                      1737
#define TSEL1                         1738
#define SCANTSEL1                     1739
#define TSEL2                         1740
#define SCANTSEL2                     1741
#define TSEL3                         1742
#define SCANTSEL3                     1743
#define CRCDATL                       1744
#define CRCDATL_DAT                   1745
#define CRCDAT0                       1746
#define DAT0                          1747
#define CRCDATL_CRCDAT                1748
#define CRCDAT1                       1749
#define DAT1                          1750
#define CRCDAT2                       1751
#define DAT2                          1752
#define CRCDAT3                       1753
#define DAT3                          1754
#define CRCDAT4                       1755
#define DAT4                          1756
#define CRCDAT5                       1757
#define DAT5                          1758
#define CRCDAT6                       1759
#define DAT6                          1760
#define DAT7                          1761
#define CRDCDAT7                      1762
#define CRCDATH                       1763
#define CRCDAT8                       1764
#define DAT8                          1765
#define CRCDATH_CRCDAT                1766
#define CRCDATH_DAT                   1767
#define CRCDAT9                       1768
#define DAT9                          1769
#define DAT10                         1770
#define CRCDAT10                      1771
#define DAT11                         1772
#define CRCDAT11                      1773
#define DAT12                         1774
#define CRCDAT12                      1775
#define DAT13                         1776
#define CRCDAT13                      1777
#define DAT14                         1778
#define CRCDAT14                      1779
#define DAT15                         1780
#define CRCDAT15                      1781
#define CRCACCL                       1782
#define CRCACCL_CRCACC                1783
#define CRCACC0                       1784
#define CRCACCL_ACC0                  1785
#define CRCACCL_ACC                   1786
#define CRCACC1                       1787
#define CRCACCL_ACC1                  1788
#define CRCACC2                       1789
#define CRCACCL_ACC2                  1790
#define CRCACC3                       1791
#define CRCACCL_ACC3                  1792
#define CRCACC4                       1793
#define CRCACCL_ACC4                  1794
#define CRCACC5                       1795
#define CRCACCL_ACC5                  1796
#define CRCACC6                       1797
#define CRCACCL_ACC6                  1798
#define CRCACC7                       1799
#define CRCACCL_ACC7                  1800
#define CRCACCH                       1801
#define CRCACCH_ACC                   1802
#define CRCACCH_CRCACC                1803
#define CRCACC8                       1804
#define CRCACCH_ACC8                  1805
#define CRCACC9                       1806
#define CRCACCH_ACC9                  1807
#define CRCACCH_ACC10                 1808
#define CRCACC10                      1809
#define CRCACCH_ACC11                 1810
#define CRCACC11                      1811
#define CRCACCH_ACC12                 1812
#define CRCACC12                      1813
#define CRCACCH_ACC13                 1814
#define CRCACC13                      1815
#define CRCACCH_ACC14                 1816
#define CRCACC14                      1817
#define CRCACCH_ACC15                 1818
#define CRCACC15                      1819
#define CRCSHIFTL                     1820
#define CRCSHIFTL_CRCSHIFT            1821
#define CRCSHIFTL_SHIFT               1822
#define SHIFT0                        1823
#define CRCSHIFT0                     1824
#define SHIFT1                        1825
#define CRCSHIFT1                     1826
#define SHIFT2                        1827
#define CRCSHIFT2                     1828
#define SHIFT3                        1829
#define CRCSHIFT3                     1830
#define SHIFT4                        1831
#define CRCSHIFT4                     1832
#define SHIFT5                        1833
#define CRCSHIFT5                     1834
#define SHIFT6                        1835
#define CRCSHIFT6                     1836
#define SHIFT7                        1837
#define CRCSHIFT7                     1838
#define CRCSHIFTH                     1839
#define CRCSHIFT8                     1840
#define CRCSHIFTH_SHIFT               1841
#define CRCSHIFTH_CRCSHIFT            1842
#define SHIFT8                        1843
#define CRCSHIFT9                     1844
#define SHIFT9                        1845
#define SHIFT10                       1846
#define CRCSHIFT10                    1847
#define SHIFT11                       1848
#define CRCSHIFT11                    1849
#define SHIFT12                       1850
#define CRCSHIFT12                    1851
#define SHIFT13                       1852
#define CRCSHIFT13                    1853
#define CRCSHIFT14                    1854
#define SHIFT14                       1855
#define SHIFT15                       1856
#define CRCSHIFT15                    1857
#define CRCXORL                       1858
#define XOR1                          1859
#define CRCXOR1                       1860
#define XOR2                          1861
#define CRCXOR2                       1862
#define XOR3                          1863
#define CRCXOR3                       1864
#define XOR4                          1865
#define CRCXOR4                       1866
#define XOR5                          1867
#define CRCXOR5                       1868
#define XOR6                          1869
#define CRCXOR6                       1870
#define XOR7                          1871
#define CRCXOR7                       1872
#define CRCXORH                       1873
#define XOR8                          1874
#define CRCXOR8                       1875
#define XOR9                          1876
#define CRCXOR9                       1877
#define CRCXOR10                      1878
#define XOR10                         1879
#define CRCXOR11                      1880
#define XOR11                         1881
#define XOR12                         1882
#define CRCXOR12                      1883
#define XOR13                         1884
#define CRCXOR13                      1885
#define CRCXOR14                      1886
#define XOR14                         1887
#define CRCXOR15                      1888
#define XOR15                         1889
#define CRCCON0                       1890
#define CRCFULL                       1891
#define FULL                          1892
#define CRCSHIFTM                     1893
#define SHIFTM                        1894
#define ACCM                          1895
#define CRCACCM                       1896
#define CRCCON0_BUSY                  1897
#define CRCBUSY                       1898
#define CRCGO                         1899
#define CRCCON0_EN                    1900
#define CRCEN                         1901
#define CRCCON1                       1902
#define PLEN0                         1903
#define CRCPLEN0                      1904
#define PLEN                          1905
#define CRCPLEN                       1906
#define PLEN1                         1907
#define CRCPLEN1                      1908
#define PLEN2                         1909
#define CRCPLEN2                      1910
#define PLEN3                         1911
#define CRCPLEN3                      1912
#define DLEN                          1913
#define CRCDLEN                       1914
#define CRCDLEN0                      1915
#define DLEN0                         1916
#define DLEN1                         1917
#define CRCDLEN1                      1918
#define CRCDLEN2                      1919
#define DLEN2                         1920
#define DLEN3                         1921
#define CRCDLEN3                      1922
#define AT1RESL                       1923
#define AT1RES0                       1924
#define RES0                          1925
#define RES1                          1926
#define AT1RES1                       1927
#define AT1RES2                       1928
#define RES2                          1929
#define AT1RES3                       1930
#define RES3                          1931
#define AT1RES4                       1932
#define RES4                          1933
#define AT1RES5                       1934
#define RES5                          1935
#define RES6                          1936
#define AT1RES6                       1937
#define AT1RES7                       1938
#define RES7                          1939
#define AT1RESH                       1940
#define RES8                          1941
#define AT1RES8                       1942
#define RES9                          1943
#define AT1RES9                       1944
#define AT1MISSL                      1945
#define AT1MISS0                      1946
#define MISS0                         1947
#define AT1MISS1                      1948
#define MISS1                         1949
#define AT1MISS2                      1950
#define MISS2                         1951
#define AT1MISS3                      1952
#define MISS3                         1953
#define AT1MISS4                      1954
#define MISS4                         1955
#define AT1MISS5                      1956
#define MISS5                         1957
#define AT1MISS6                      1958
#define MISS6                         1959
#define AT1MISS7                      1960
#define MISS7                         1961
#define AT1MISSH                      1962
#define MISS8                         1963
#define AT1MISS8                      1964
#define MISS9                         1965
#define AT1MISS9                      1966
#define MISS10                        1967
#define AT1MISS10                     1968
#define MISS11                        1969
#define AT1MISS11                     1970
#define AT1MISS12                     1971
#define MISS12                        1972
#define AT1MISS13                     1973
#define MISS13                        1974
#define AT1MISS14                     1975
#define MISS14                        1976
#define AT1MISS15                     1977
#define MISS15                        1978
#define AT1PERL                       1979
#define PER0                          1980
#define AT1PER0                       1981
#define PERL0                         1982
#define PER1                          1983
#define AT1PER1                       1984
#define PERL1                         1985
#define PER2                          1986
#define AT1PER2                       1987
#define PERL2                         1988
#define PER3                          1989
#define AT1PER3                       1990
#define PERL3                         1991
#define PER4                          1992
#define AT1PER4                       1993
#define PERL4                         1994
#define PER5                          1995
#define AT1PER5                       1996
#define PERL5                         1997
#define PER6                          1998
#define AT1PER6                       1999
#define PERL6                         2000
#define PER7                          2001
#define AT1PER7                       2002
#define PERL7                         2003
#define AT1PERH                       2004
#define PER8                          2005
#define AT1PER8                       2006
#define PERH0                         2007
#define PER9                          2008
#define AT1PER9                       2009
#define PERH1                         2010
#define AT1PER10                      2011
#define PER10                         2012
#define PERH2                         2013
#define AT1PER11                      2014
#define PER11                         2015
#define PERH3                         2016
#define AT1PER12                      2017
#define PER12                         2018
#define PERH4                         2019
#define AT1PER13                      2020
#define PER13                         2021
#define PERH5                         2022
#define AT1PER14                      2023
#define PER14                         2024
#define PERH6                         2025
#define PER15                         2026
#define AT1POV                        2027
#define PERH7                         2028
#define AT1PHSL                       2029
#define PHS0                          2030
#define AT1PHS0                       2031
#define PHS1                          2032
#define AT1PHS1                       2033
#define PHS2                          2034
#define AT1PHS2                       2035
#define PHS3                          2036
#define AT1PHS3                       2037
#define PHS4                          2038
#define AT1PHS4                       2039
#define PHS5                          2040
#define AT1PHS5                       2041
#define PHS6                          2042
#define AT1PHS6                       2043
#define PHS7                          2044
#define AT1PHS7                       2045
#define AT1PHSH                       2046
#define PHSL8                         2047
#define PHS8                          2048
#define AT1PHS8                       2049
#define PHSL9                         2050
#define PHS9                          2051
#define AT1PHS9                       2052
#define AT1CON0                       2053
#define AT1CON0_MODE                  2054
#define AT1MODE                       2055
#define APMOD                         2056
#define AT1APMOD                      2057
#define AT1CON0_POL                   2058
#define AT1POL                        2059
#define AT1PS0                        2060
#define AT1CON0_PS                    2061
#define AT1PS                         2062
#define AT1CON0_PS0                   2063
#define AT1PS1                        2064
#define AT1CON0_PS1                   2065
#define PREC                          2066
#define AT1PREC                       2067
#define AT1CON0_EN                    2068
#define AT1EN                         2069
#define AT1CON1                       2070
#define AT1VALID                      2071
#define VALID                         2072
#define AT1ACCS                       2073
#define ACCS                          2074
#define MPP                           2075
#define AT1MPP                        2076
#define AT1PRP                        2077
#define PRP                           2078
#define AT1PHP                        2079
#define PHP                           2080
#define AT1IR0                        2081
#define AT1PERIF                      2082
#define AT1MISSIF                     2083
#define AT1PHSIF                      2084
#define AT1IE0                        2085
#define AT1PERIE                      2086
#define AT1MISSIE                     2087
#define AT1PHSIE                      2088
#define AT1IR1                        2089
#define AT1CC1IF                      2090
#define AT1CC2IF                      2091
#define AT1CC3IF                      2092
#define AT1IE1                        2093
#define AT1CC1IE                      2094
#define AT1CC2IE                      2095
#define AT1CC3IE                      2096
#define AT1STPTL                      2097
#define STPT0                         2098
#define AT1STPT0                      2099
#define STPT1                         2100
#define AT1STPT1                      2101
#define STPT2                         2102
#define AT1STPT2                      2103
#define STPT3                         2104
#define AT1STPT3                      2105
#define STPT4                         2106
#define AT1STPT4                      2107
#define STPT5                         2108
#define AT1STPT5                      2109
#define STPT6                         2110
#define AT1STPT6                      2111
#define STPT7                         2112
#define AT1STPT7                      2113
#define AT1STPTH                      2114
#define STPT8                         2115
#define AT1STPT8                      2116
#define STPT9                         2117
#define AT1STPT9                      2118
#define AT1STPT10                     2119
#define STPT10                        2120
#define AT1STPT11                     2121
#define STPT11                        2122
#define AT1STPT12                     2123
#define STPT12                        2124
#define AT1STPT13                     2125
#define STPT13                        2126
#define AT1STPT14                     2127
#define STPT14                        2128
#define AT1ERRL                       2129
#define AT1ERR0                       2130
#define ERR0                          2131
#define ERRL0                         2132
#define AT1ERR1                       2133
#define ERR1                          2134
#define ERRL1                         2135
#define AT1ERR2                       2136
#define ERR2                          2137
#define ERRL2                         2138
#define AT1ERR3                       2139
#define ERR3                          2140
#define ERRL3                         2141
#define AT1ERR4                       2142
#define ERRL4                         2143
#define ERR4                          2144
#define AT1ERR5                       2145
#define ERRL5                         2146
#define ERR5                          2147
#define AT1ERR6                       2148
#define ERRL6                         2149
#define ERR6                          2150
#define AT1ERR7                       2151
#define ERRL7                         2152
#define ERR7                          2153
#define AT1ERRH                       2154
#define AT1ERR8                       2155
#define ERRH0                         2156
#define ERR8                          2157
#define AT1ERR9                       2158
#define ERRH1                         2159
#define ERR9                          2160
#define AT1ERR10                      2161
#define ERR10                         2162
#define ERRH2                         2163
#define AT1ERR11                      2164
#define ERR11                         2165
#define ERRH3                         2166
#define AT1ERR12                      2167
#define ERR12                         2168
#define ERRH4                         2169
#define AT1ERR13                      2170
#define ERR13                         2171
#define ERRH5                         2172
#define AT1ERR14                      2173
#define ERR14                         2174
#define ERRH6                         2175
#define AT1ERR15                      2176
#define ERR15                         2177
#define ERRH7                         2178
#define AT1CLK                        2179
#define AT1CLK_CS                     2180
#define AT1CS                         2181
#define AT1CLK_CS0                    2182
#define AT1CS0                        2183
#define AT1SIG                        2184
#define AT1SSEL0                      2185
#define AT1SIG_SSEL0                  2186
#define AT1SIG_SSEL                   2187
#define AT1SSEL                       2188
#define AT1SSEL1                      2189
#define AT1SIG_SSEL1                  2190
#define AT1SSEL2                      2191
#define AT1SIG_SSEL2                  2192
#define AT1CSEL1                      2193
#define CP1S0                         2194
#define AT1CP1S0                      2195
#define AT1CP1S                       2196
#define CP1S                          2197
#define CP1S1                         2198
#define AT1CP1S1                      2199
#define CP1S2                         2200
#define AT1CP1S2                      2201
#define AT1CC1L                       2202
#define AT1CC10                       2203
#define CC10                          2204
#define AT1CC11                       2205
#define CC11                          2206
