tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1618_tdd.h
#define T4PPS1                        2765
#define T4PPS2                        2766
#define T4PPS3                        2767
#define T4PPS4                        2768
#define T5CKIPPS                      2769
#define T5CKIPPS0                     2770
#define T5CKIPPS1                     2771
#define T5CKIPPS2                     2772
#define T5CKIPPS3                     2773
#define T5CKIPPS4                     2774
#define T5GPPS                        2775
#define T5GPPS0                       2776
#define T5GPPS1                       2777
#define T5GPPS2                       2778
#define T5GPPS3                       2779
#define T5GPPS4                       2780
#define T6PPS                         2781
#define T6PPS0                        2782
#define T6PPS1                        2783
#define T6PPS2                        2784
#define T6PPS3                        2785
#define T6PPS4                        2786
#define ATCC1PPS                      2787
#define ATCC1PPS0                     2788
#define ATCC1PPS1                     2789
#define ATCC1PPS2                     2790
#define ATCC1PPS3                     2791
#define ATCC1PPS4                     2792
#define SSPCLKPPS                     2793
#define SSPCLKPPS0                    2794
#define SSPCLKPPS1                    2795
#define SSPCLKPPS2                    2796
#define SSPCLKPPS3                    2797
#define SSPCLKPPS4                    2798
#define SSPDATPPS                     2799
#define SSPDATPPS0                    2800
#define SSPDATPPS1                    2801
#define SSPDATPPS2                    2802
#define SSPDATPPS3                    2803
#define SSPDATPPS4                    2804
#define SSPSSPPS                      2805
#define SSPSSPPS0                     2806
#define SSPSSPPS1                     2807
#define SSPSSPPS2                     2808
#define SSPSSPPS3                     2809
#define SSPSSPPS4                     2810
#define ATCC2PPS                      2811
#define ATCC2PPS0                     2812
#define ATCC2PPS1                     2813
#define ATCC2PPS2                     2814
#define ATCC2PPS3                     2815
#define ATCC2PPS4                     2816
#define RXPPS                         2817
#define RXPPS0                        2818
#define RXPPS1                        2819
#define RXPPS2                        2820
#define RXPPS3                        2821
#define RXPPS4                        2822
#define CKPPS                         2823
#define CKPPS0                        2824
#define CKPPS1                        2825
#define CKPPS2                        2826
#define CKPPS3                        2827
#define CKPPS4                        2828
#define SMT1SIGPPS                    2829
#define SMT1SIGPPS0                   2830
#define SMT1SIGPPS1                   2831
#define SMT1SIGPPS2                   2832
#define SMT1SIGPPS3                   2833
#define SMT1SIGPPS4                   2834
#define SMT1WINPPS                    2835
#define SMTWINPPS0                    2836
#define SMTWINPPS1                    2837
#define SMTWINPPS2                    2838
#define SMTWINPPS3                    2839
#define SMTWINPPS4                    2840
#define CLCIN0PPS                     2841
#define CLCIN0PPS0                    2842
#define CLCIN0PPS1                    2843
#define CLCIN0PPS2                    2844
#define CLCIN0PPS3                    2845
#define CLCIN0PPS4                    2846
#define CLCIN1PPS                     2847
#define CLCIN1PPS0                    2848
#define CLCIN1PPS1                    2849
#define CLCIN1PPS2                    2850
#define CLCIN1PPS3                    2851
#define CLCIN1PPS4                    2852
#define CLCIN2PPS                     2853
#define CLCIN2PPS0                    2854
#define CLCIN2PPS1                    2855
#define CLCIN2PPS2                    2856
#define CLCIN2PPS3                    2857
#define CLCIN2PPS4                    2858
#define CLCIN3PPS                     2859
#define CLCIN3PPS0                    2860
#define CLCIN3PPS1                    2861
#define CLCIN3PPS2                    2862
#define CLCIN3PPS3                    2863
#define CLCIN3PPS4                    2864
#define SMT2SIGPPS                    2865
#define SMT2SIGPPS0                   2866
#define SMT2SIGPPS1                   2867
#define SMT2SIGPPS2                   2868
#define SMT2SIGPPS3                   2869
#define SMT2SIGPPS4                   2870
#define SMT2WINPPS                    2871
#define SMT2WINPPS0                   2872
#define SMT2WINPPS1                   2873
#define SMT2WINPPS2                   2874
#define SMT2WINPPS3                   2875
#define SMT2WINPPS4                   2876
#define ATCC3PPS                      2877
#define ATCC3PPS0                     2878
#define ATCC3PPS1                     2879
#define ATCC3PPS2                     2880
#define ATCC3PPS3                     2881
#define ATCC3PPS4                     2882
#define RA0PPS                        2883
#define RA0PPS0                       2884
#define RA0PPS1                       2885
#define RA0PPS2                       2886
#define RA0PPS3                       2887
#define RA0PPS4                       2888
#define RA1PPS                        2889
#define RA1PPS0                       2890
#define RA1PPS1                       2891
#define RA1PPS2                       2892
#define RA1PPS3                       2893
#define RA1PPS4                       2894
#define RA2PPS                        2895
#define RA2PPS0                       2896
#define RA2PPS1                       2897
#define RA2PPS2                       2898
#define RA2PPS3                       2899
#define RA2PPS4                       2900
#define RA4PPS                        2901
#define RA4PPS0                       2902
#define RA4PPS1                       2903
#define RA4PPS2                       2904
#define RA4PPS3                       2905
#define RA4PPS4                       2906
#define RA5PPS                        2907
#define RA5PPS0                       2908
#define RA5PPS1                       2909
#define RA5PPS2                       2910
#define RA5PPS3                       2911
#define RA5PPS4                       2912
#define RB4PPS                        2913
#define RB4PPS0                       2914
#define RB4PPS1                       2915
#define RB4PPS2                       2916
#define RB4PPS3                       2917
#define RB4PPS4                       2918
#define RB5PPS                        2919
#define RB5PPS0                       2920
#define RB5PPS1                       2921
#define RB5PPS2                       2922
#define RB5PPS3                       2923
#define RB5PPS4                       2924
#define RB6PPS                        2925
#define RB6PPS0                       2926
#define RB6PPS1                       2927
#define RB6PPS2                       2928
#define RB6PPS3                       2929
#define RB6PPS4                       2930
#define RB7PPS                        2931
#define RB7PPS0                       2932
#define RB7PPS1                       2933
#define RB7PPS2                       2934
#define RB7PPS3                       2935
#define RB7PPS4                       2936
#define RC0PPS                        2937
#define RC0PPS0                       2938
#define RC0PPS1                       2939
#define RC0PPS2                       2940
#define RC0PPS3                       2941
#define RC0PPS4                       2942
#define RC1PPS                        2943
#define RC1PPS0                       2944
#define RC1PPS1                       2945
#define RC1PPS2                       2946
#define RC1PPS3                       2947
#define RC1PPS4                       2948
#define RC2PPS                        2949
#define RC2PPS0                       2950
#define RC2PPS1                       2951
#define RC2PPS2                       2952
#define RC2PPS3                       2953
#define RC2PPS4                       2954
#define RC3PPS                        2955
#define RC3PPS0                       2956
#define RC3PPS1                       2957
#define RC3PPS2                       2958
#define RC3PPS3                       2959
#define RC3PPS4                       2960
#define RC4PPS                        2961
#define RC4PPS0                       2962
#define RC4PPS1                       2963
#define RC4PPS2                       2964
#define RC4PPS3                       2965
#define RC4PPS4                       2966
#define RC5PPS                        2967
#define RC5PPS0                       2968
#define RC5PPS1                       2969
#define RC5PPS2                       2970
#define RC5PPS3                       2971
#define RC5PPS4                       2972
#define RC6PPS                        2973
#define RC6PPS0                       2974
#define RC6PPS1                       2975
#define RC6PPS2                       2976
#define RC6PPS3                       2977
#define RC6PPS4                       2978
#define RC7PPS                        2979
#define RC7PPS0                       2980
#define RC7PPS1                       2981
#define RC7PPS2                       2982
#define RC7PPS3                       2983
#define RC7PPS4                       2984
#define CLCDATA                       2985
#define MLC1OUT                       2986
#define MLC2OUT                       2987
#define CLC1CON                       2988
#define CLC1CON_MODE                  2989
#define LC1MODE0                      2990
#define LC1MODE                       2991
#define CLC1CON_MODE0                 2992
#define LC1MODE1                      2993
#define CLC1CON_MODE1                 2994
#define LC1MODE2                      2995
#define CLC1CON_MODE2                 2996
#define LC1INTN                       2997
#define CLC1CON_INTN                  2998
#define LC1INTP                       2999
#define CLC1CON_INTP                  3000
#define LC1OUT                        3001
#define CLC1CON_OUT                   3002
#define LC1EN                         3003
#define CLC1CON_EN                    3004
#define CLC1POL                       3005
#define LC1G1POL                      3006
#define CLC1POL_G1POL                 3007
#define CLC1POL_G2POL                 3008
#define LC1G2POL                      3009
#define LC1G3POL                      3010
#define CLC1POL_G3POL                 3011
#define LC1G4POL                      3012
#define CLC1POL_G4POL                 3013
#define CLC1POL_POL                   3014
#define LC1POL                        3015
#define CLC1SEL0                      3016
#define CLC1SEL0_D1S0                 3017
#define LC1D1S0                       3018
#define CLC1SEL0_D1S                  3019
#define LC1D1S                        3020
#define CLC1SEL0_D1S1                 3021
#define LC1D1S1                       3022
#define CLC1SEL0_D1S2                 3023
#define LC1D1S2                       3024
#define LC1D1S3                       3025
#define CLC1SEL0_D1S3                 3026
#define CLC1SEL0_D1S4                 3027
#define LC1D1S4                       3028
#define CLC1SEL0_D1S5                 3029
#define LC1D1S5                       3030
#define CLC1SEL1                      3031
#define CLC1SEL1_D2S0                 3032
#define CLC1SEL1_D2S                  3033
#define LC1D2S                        3034
#define LC1D2S0                       3035
#define CLC1SEL1_D2S1                 3036
#define LC1D2S1                       3037
#define CLC1SEL1_D2S2                 3038
#define LC1D2S2                       3039
#define LC1D2S3                       3040
#define CLC1SEL1_D2S3                 3041
#define LC1D2S4                       3042
#define CLC1SEL1_D2S4                 3043
#define LC1D2S5                       3044
#define CLC1SEL1_D2S5                 3045
#define CLC1SEL2                      3046
#define LC1D3S0                       3047
#define CLC1SEL2_D3S                  3048
#define LC1D3S                        3049
#define CLC1SEL2_D3S0                 3050
#define LC1D3S1                       3051
#define CLC1SEL2_D3S1                 3052
#define LC1D3S2                       3053
#define CLC1SEL2_D3S2                 3054
#define LC1D3S3                       3055
#define CLC1SEL2_D3S3                 3056
#define LC1D3S4                       3057
#define CLC1SEL2_D3S4                 3058
#define LC1D3S5                       3059
#define CLC1SEL2_D3S5                 3060
#define CLC1SEL3                      3061
#define CLC1SEL3_D4S                  3062
#define LC1D4S                        3063
#define LC1D4S0                       3064
#define CLC1SEL3_D4S0                 3065
#define CLC1SEL3_D4S1                 3066
#define LC1D4S1                       3067
#define LC1D4S2                       3068
#define CLC1SEL3_D4S2                 3069
#define LC1D4S3                       3070
#define CLC1SEL3_D4S3                 3071
#define LC1D4S4                       3072
#define CLC1SEL3_D4S4                 3073
#define LC1D4S5                       3074
#define CLC1SEL3_D4S5                 3075
#define CLC1GLS0                      3076
#define CLC1GLS0_D1N                  3077
#define LC1G1D1N                      3078
#define CLC1GLS0_D1T                  3079
#define LC1G1D1T                      3080
#define LC1G1D2N                      3081
#define CLC1GLS0_D2N                  3082
#define LC1G1D2T                      3083
#define CLC1GLS0_D2T                  3084
#define CLC1GLS0_D3N                  3085
#define LC1G1D3N                      3086
#define CLC1GLS0_D3T                  3087
#define LC1G1D3T                      3088
#define CLC1GLS0_D4N                  3089
#define LC1G1D4N                      3090
#define CLC1GLS0_D4T                  3091
#define LC1G1D4T                      3092
#define CLC1GLS1                      3093
#define CLC1GLS1_D1N                  3094
#define LC1G2D1N                      3095
#define LC1G2D1T                      3096
#define CLC1GLS1_D1T                  3097
#define CLC1GLS1_D2N                  3098
#define LC1G2D2N                      3099
#define LC1G2D2T                      3100
#define CLC1GLS1_D2T                  3101
#define CLC1GLS1_D3N                  3102
#define LC1G2D3N                      3103
#define LC1G2D3T                      3104
#define CLC1GLS1_D3T                  3105
#define CLC1GLS1_D4N                  3106
#define LC1G2D4N                      3107
#define LC1G2D4T                      3108
#define CLC1GLS1_D4T                  3109
#define CLC1GLS2                      3110
#define CLC1GLS2_D1N                  3111
#define LC1G3D1N                      3112
#define LC1G3D1T                      3113
#define CLC1GLS2_D1T                  3114
#define LC1G3D2N                      3115
#define CLC1GLS2_D2N                  3116
#define LC1G3D2T                      3117
#define CLC1GLS2_D2T                  3118
#define CLC1GLS2_D3N                  3119
#define LC1G3D3N                      3120
#define LC1G3D3T                      3121
#define CLC1GLS2_D3T                  3122
#define LC1G3D4N                      3123
#define CLC1GLS2_D4N                  3124
#define LC1G3D4T                      3125
#define CLC1GLS2_D4T                  3126
#define CLC1GLS3                      3127
#define LC1G4D1N                      3128
#define CLC1GLS3_G4D1N                3129
#define LC1G4D1T                      3130
#define CLC1GLS3_G4D1T                3131
#define CLC1GLS3_G4D2N                3132
#define LC1G4D2N                      3133
#define CLC1GLS3_G4D2T                3134
#define LC1G4D2T                      3135
#define LC1G4D3N                      3136
#define CLC1GLS3_G4D3N                3137
#define LC1G4D3T                      3138
#define CLC1GLS3_G4D3T                3139
#define CLC1GLS3_G4D4N                3140
#define LC1G4D4N                      3141
#define CLC1GLS3_G4D4T                3142
#define LC1G4D4T                      3143
#define CLC2CON                       3144
#define LC2MODE0                      3145
#define CLC2CON_MODE                  3146
#define LC2MODE                       3147
#define CLC2CON_MODE0                 3148
#define LC2MODE1                      3149
#define CLC2CON_MODE1                 3150
#define LC2MODE2                      3151
#define CLC2CON_MODE2                 3152
#define LC2INTN                       3153
#define CLC2CON_INTN                  3154
#define LC2INTP                       3155
#define CLC2CON_INTP                  3156
#define CLC2CON_OUT                   3157
#define LC2OUT                        3158
#define CLC2CON_EN                    3159
#define LC2EN                         3160
#define CLC2POL                       3161
#define LC2G1POL                      3162
#define CLC2POL_G1POL                 3163
#define LC2G2POL                      3164
#define CLC2POL_G2POL                 3165
#define LC2G3POL                      3166
#define CLC2POL_G3POL                 3167
#define LC2G4POL                      3168
#define CLC2POL_G4POL                 3169
#define CLC2POL_POL                   3170
#define LC2POL                        3171
#define CLC2SEL0                      3172
#define CLC2SEL0_D1S                  3173
#define LC2D1S0                       3174
#define CLC2SEL0_D1S0                 3175
#define LC2D1S                        3176
#define LC2D1S1                       3177
#define CLC2SEL0_D1S1                 3178
#define LC2D1S2                       3179
#define CLC2SEL0_D1S2                 3180
#define CLC2SEL0_D1S3                 3181
#define LC2D1S3                       3182
#define LC2D1S4                       3183
#define CLC2SEL0_D1S4                 3184
#define LC2D1S5                       3185
#define CLC2SEL0_D1S5                 3186
#define CLC2SEL1                      3187
#define LC2D2S0                       3188
#define CLC2SEL1_D2S0                 3189
#define LC2D2S                        3190
#define CLC2SEL1_D2S                  3191
#define LC2D2S1                       3192
#define CLC2SEL1_D2S1                 3193
#define LC2D2S2                       3194
#define CLC2SEL1_D2S2                 3195
#define LC2D2S3                       3196
#define CLC2SEL1_D2S3                 3197
#define LC2D2S4                       3198
#define CLC2SEL1_D2S4                 3199
#define LC2D2S5                       3200
#define CLC2SEL1_D2S5                 3201
#define CLC2SEL2                      3202
#define CLC2SEL2_D3S                  3203
#define LC2D3S0                       3204
#define CLC2SEL2_D3S0                 3205
#define LC2D3S                        3206
#define CLC2SEL2_D3S1                 3207
#define LC2D3S1                       3208
#define LC2D3S2                       3209
#define CLC2SEL2_D3S2                 3210
#define LC2D3S3                       3211
#define CLC2SEL2_D3S3                 3212
#define LC2D3S4                       3213
#define CLC2SEL2_D3S4                 3214
#define LC2D3S5                       3215
#define CLC2SEL2_D3S5                 3216
#define CLC2SEL3                      3217
#define LC2D4S0                       3218
#define CLC2SEL3_D4S                  3219
#define CLC2SEL3_D4S0                 3220
#define LC2D4S                        3221
#define LC2D4S1                       3222
#define CLC2SEL3_D4S1                 3223
#define LC2D4S2                       3224
#define CLC2SEL3_D4S2                 3225
#define CLC2SEL3_D4S3                 3226
#define LC2D4S3                       3227
#define LC2D4S4                       3228
#define CLC2SEL3_D4S4                 3229
#define LC2D4S5                       3230
#define CLC2SEL3_D4S5                 3231
#define CLC2GLS0                      3232
#define LC2G1D1N                      3233
#define CLC2GLS0_D1N                  3234
#define CLC2GLS0_D1T                  3235
#define LC2G1D1T                      3236
#define LC2G1D2N                      3237
#define CLC2GLS0_D2N                  3238
#define CLC2GLS0_D2T                  3239
#define LC2G1D2T                      3240
#define LC2G1D3N                      3241
#define CLC2GLS0_D3N                  3242
#define CLC2GLS0_D3T                  3243
#define LC2G1D3T                      3244
#define LC2G1D4N                      3245
#define CLC2GLS0_D4N                  3246
#define CLC2GLS0_D4T                  3247
#define LC2G1D4T                      3248
#define CLC2GLS1                      3249
#define CLC2GLS1_D1N                  3250
#define LC2G2D1N                      3251
#define CLC2GLS1_D1T                  3252
#define LC2G2D1T                      3253
#define CLC2GLS1_D2N                  3254
#define LC2G2D2N                      3255
#define CLC2GLS1_D2T                  3256
#define LC2G2D2T                      3257
#define LC2G2D3N                      3258
#define CLC2GLS1_D3N                  3259
#define LC2G2D3T                      3260
#define CLC2GLS1_D3T                  3261
#define LC2G2D4N                      3262
#define CLC2GLS1_D4N                  3263
#define LC2G2D4T                      3264
#define CLC2GLS1_D4T                  3265
#define CLC2GLS2                      3266
#define LC2G3D1N                      3267
#define CLC2GLS2_D1N                  3268
#define CLC2GLS2_D1T                  3269
#define LC2G3D1T                      3270
#define CLC2GLS2_D2N                  3271
#define LC2G3D2N                      3272
#define LC2G3D2T                      3273
#define CLC2GLS2_D2T                  3274
#define CLC2GLS2_D3N                  3275
#define LC2G3D3N                      3276
#define CLC2GLS2_D3T                  3277
#define LC2G3D3T                      3278
#define CLC2GLS2_D4N                  3279
#define LC2G3D4N                      3280
#define LC2G3D4T                      3281
#define CLC2GLS2_D4T                  3282
#define CLC2GLS3                      3283
#define LC2G4D1N                      3284
#define CLC2GLS3_G4D1N                3285
#define CLC2GLS3_G4D1T                3286
#define LC2G4D1T                      3287
#define CLC2GLS3_G4D2N                3288
#define LC2G4D2N                      3289
#define LC2G4D2T                      3290
#define CLC2GLS3_G4D2T                3291
#define CLC2GLS3_G4D3N                3292
#define LC2G4D3N                      3293
#define CLC2GLS3_G4D3T                3294
#define LC2G4D3T                      3295
#define LC2G4D4N                      3296
#define CLC2GLS3_G4D4N                3297
#define CLC2GLS3_G4D4T                3298
#define LC2G4D4T                      3299
#define STATUS_SHAD                   3300
#define C_SHAD                        3301
#define DC_SHAD                       3302
#define Z_SHAD                        3303
#define WREG_SHAD                     3304
#define BSR_SHAD                      3305
#define PCLATH_SHAD                   3306
#define FSR0L_SHAD                    3307
#define FSR0H_SHAD                    3308
#define FSR1L_SHAD                    3309
#define FSR1H_SHAD                    3310
#define STKPTR                        3311
#define TOSL                          3312
#define TOSH                          3313

#endif // _PIC16LF1618_H_
